package com.ylab.intensive.ui;

public class ConsoleText {
    public static final String WELCOME = "\u001B[42;5;18m \u001B[1;30m Здравствуйте, добро пожаловать в консольное приложения! Следуйте указаниям из документации. \n\u001B[0m";
    public static final String AUTHORIZED_USER = "\u001B[48;5;12m \u001B[1;30mЯ %s \n\u001B[0m";
    public static final String MENU =
            "\u001B[48;5;8m 1 - регистрация пользователя\n" +
            " 2 - авторизация пользователя\n" +
            " 3 - расширить перечень типов тренировок\n" +
            " 4 - добавить новую тренировку\n" +
            " 5 - добавить дополнительную информацию о тренировке\n" +
            " 6 - посмотреть свои предыдущие тренировки\n" +
            " 7 - редактировать тренировку\n" +
            " 8 - удалить тренировку\n" +
            " 9 - изменить права пользователя\n" +
            " 10 - получить статистику по тренировкам\n" +
            " 11 - просмотр Аудит действий\n" +
            " 12 - выход (разлогиниться)\n\u001B[0m";

}
