package com.ylab.intensive.ui;

public class ConsoleText {
    public static final String WELCOME = " Здравствуйте, добро пожаловать в консольное приложения! Следуйте указаниям из документации. ";
    public static final String AUTHORIZED_USER = " Я %s ";
    public static final String MENU_NOT_AUTH =
            " 1 - регистрация пользователя\n" +
            " 2 - авторизация пользователя\n" +
            " 12 - завершить приложения ";
    public static final String MENU_AUTH =
            " 3 - расширить перечень типов тренировок\n" +
            " 4 - добавить новую тренировку\n" +
            " 5 - добавить дополнительную информацию о тренировке\n" +
            " 6 - посмотреть свои предыдущие тренировки\n" +
            " 7 - редактировать тренировку\n" +
            " 8 - удалить тренировку\n" +
            " 9 - изменить права пользователя\n" +
            " 10 - получить статистику по тренировкам\n" +
            " 11 - просмотр Аудит действий\n" +
            " 12 - выход (разлогиниться) ";
    public static final String UNKNOWN_COMMAND = "Неизвестная команда, попробуйте еще раз.";
    public static final String GOODBYE = "Приложение успешно завершилось. \n" +
                                         "Благодарим вас за использование нашего консольного приложения. \n" +
                                         "Если у вас есть какие-либо вопросы, не стесняйтесь обращаться к нам https://t.me/orifov_nur. \n" +
                                         "Удачи!";
}
